# 1) შექმენი სტრინგი, სადაც ჩაწერ შენს სახელს.
#   -> დაბეჭდე პირველი სიმბოლო ინდექსის გამოყენებით
name="gio"
print(name[0])

# 2) შექმენი სტრინგი, სადაც ჩაწერ შენს გვარს.
#   -> დაბეჭდე ბოლო სიმბოლო ინდექსის გამოყენებით
lastname="Lomtadze"
print(lastname[-1])

# 3) შექმენი სტრინგი: "Python"
#   -> დაბეჭდე მესამე სიმბოლ
string="python"
print(string[2])

# 4) შექმენი სტრინგი: "Programming"
#   -> დაბეჭდე პირველი 4 სიმბოლო (სლაისინგით)
string="programming"
print(string[0:4])

# 5) შექმენი სტრინგი: "Computer"
#   -> დაბეჭდე ბოლო 3 სიმბოლო (სლაისინგით)
string="computer"
print(string[-3:])

# 6) შექმენი სტრინგი: "HelloWorld"
#   -> დაბეჭდე შუაში არსებული სიმბოლოები (მაგ: loWo)
string="helloworld"
print(string[3:-3])

# 7) შექმენი სტრინგი: "Georgia"
#   -> დაბეჭდე 2-დან 5-მდე ინდექსზე არსებული სიმბოლოები
country="georgia"
print(country[2:5])

# 8) შექმენი სტრინგი, სადაც ჩაწერ შენს საყვარელ სიტყვას
#   -> თუ პირველი სიმბოლო არის "A":
#       დაბეჭდე პირველი 3 სიმბოლო
#   -> სხვა შემთხვევაში:
#       დაბეჭდე ბოლო 3 სიმბოლო

fav_word="hello"
if fav_word[0]=="A":
    print(fav_word[0:3])
else:
    print(fav_word[-3:])

# 9) შექმენი სტრინგი: "Education"
#   -> ამოიღე პირველი და ბოლო სიმბოლო და დაბეჭდე დარჩენილი ნაწილი
string="education"
print(string[1:-1])

# 10) შექმენი სტრინგი: "Developer"
#   -> შეაერთე პირველი 3 და ბოლო 3 სიმბოლო (ახალ სტრინგში) და დაბეჭდე
string="developer"
string=string[0:3]+string[-3:]
print(string)

# 11) შექმენი სტრინგი, სადაც ჩაწერ რაიმე წინადადებას
#   -> დაბეჭდე მხოლოდ პირველი სიტყვა (სლაისინგის გამოყენებით)
string="hello world"
print(string[0:5])

# 12) შექმენი სტრინგი: "abcdef"
#   -> დაბეჭდე ყოველი მეორე სიმბოლო
string="abcdef"
print(string[1], string[3] , string[5])

# 13) შექმენი სია, სადაც შეინახავ 8 ელემენტს (ნებისმიერი ტიპის)
#   -> დაბეჭდე შუაში არსებული 4 ელემენტი
list=[1 , 2  , 3 , 4 ,5 ,True , "hello" , 8]
print(list[2:-2])

# 14) შექმენი სია, სადაც შეინახავ 6 მუსიკოსის სახელს
#   -> დაბეჭდე ბოლო 2 ელემენტი (სლაისინგით)
artists=["50cent" , "eazy-e" , "2pac" , "ice cube" , "dmx" , "kendrick lamar"]
print(artists[-2:])