# 1) ახსენით რა არის mutable და immutable?
#mutable არის ისეთი ობიექტი რომელიც იმავე ცვლადში იცვლება და არ არის საჭირო ახლის შექმნა ხოლო immutable პირიქით

# 2) ახსენით რას აკეთებს len ფუნქცია 
#len(lenght) არის ფუნქცია რომელიც აბრუნებს ცვლადის სიგრძეს

# 3) შექმენით ცვლადი სადაც შეინახავთ რაიმე სიტყვას. დაპრინტეთ რამდენი სიმბოლოა ამ სიტყვაში
text=input("enter any word: ")
print(len(text))

# 4) შექმენით ცვლადი სადაც მომხმარებელს შემოაყვანინებთ რაიმე წინადადაებას. დაპრინტეთ სიმბოლოების რაოდენობა ამ წინადადებაში
text=input("enter any sentence: ")
print(len(text))

# 5) შექმენით სია სადაც შეინახავთ რიცხვებს. for loop ის გამოყენებით დაითვალეთ რამდენი დადებითი და რამდენი უარყოფითი რიცხვია ამ სიაში
list=[5, -1 ,24, 64, -13 , 5, 6]
count1=0
count2=0
for i in range(len(list)):
    if list[i]>=0:
        count1=count1+1
    else:
        count2=count2+1
print(count1 , count2)

# 6) შექმნეით სია სადაც შეინახავთ რიცხვებს. დაითვალეთ რამდენი რიცხვი არის ამ სიაში ისეთი, რომელიც იყოფა 5-ზე
list=[10 , 5 , 125 ,1025 , 444 ,213, 99 , 100]
count=0
for i in range(len(list)):
    if list[i]%5==0:
        count=count+1
print(count)

# 7) შექმენით სია სადაც შეინახავთ რიცხვებს. დაპრინტეთ მხოლოდ ისეთი რიცხვები, რომლებიც იყოფა 4-ზეც და 7-ზეც
list=[14 , 8 , 21, 28 , 63 ,56 ,]
for i in range(len(list)):
    if list[i]%4==0 and list[i]%7==0:
        print(list[i])

# 8) შექმენით სია სადაც შეინახავთ ნებისმიერ მნიშვნელობებს. დაპრინტეთ მხოლოდ ის ელემენტები, რომლებიც იმყოფებიან ლუწ ინდექსზე
list=[1 ,2 , 3 ,"hello " , True , False]
for i in range(len(list)):
    if i %2==0:
        print(list[i])

# 9) შექმენით სია სადაც შეინახავთ სიტყვებს. დაითვალეთ იმ სიტყვების რაოდენობა, რომელთა სიგრძეც მეტია 5-ზე
list=["hello " , "welcome " , "yes" , "no" ]
count=0
for i in range(len(list)):
    if len(list[i])>5:
        count=count+1
print(count)

# 10) შექმენით ცვლადი, რომელშიც შეინახავთ რაიმე წინადადებას. for ლუპის გამოყენებით დაპრინტეთ თითოეული სიმბოლო
text=input("enter any sentence: ")
for i in range(len(text)):
    print(text[i])

# 11) შექმენით ცვლადი, რომელშიც შეინახავთ რაიმე წინადადებას. for ლუპის გამოყენებით დაპრინტეთ თითოეული სიმბოლო გარდა გამოტოვებისა
text=input("enter any sentence: ")
for i in range(len(text)):
    if text[i]!=" ":
        print(text[i])

# 12) შექმენით სია სადაც შეინახავთ სიტყვებს. for ლუპის გამოყენებით დაპრინტეთ: 'სიტყვა - სიგრძე'
list=["my" , "name" , "is" , "gio"]
for i in range(len(list)):
    print(list[i] , len(list[i]))
    
